1) /Users/charles/Workspace/perso/testinfection/src/SourceClass.php:7    [M] PublicVisibility

--- Original
+++ New
@@ @@
 
 class SourceClass
 {
-    public function hello(string $firstname) : string
+    protected function hello(string $firstname) : string
     {
         return 'hello ' . $firstname;
     }
 }

$ '/Users/charles/Workspace/perso/testinfection/vendor/phpunit/phpunit/phpunit' '--configuration' '/var/folders/4q/tdlvv18x0wb1sh19lxlyxwzm0000gn/T/infection/phpunitConfiguration.c1c5d337e5fa84df1872cf82c0ad6401.infection.xml'
  PHPUnit 9.5.9 by Sebastian Bergmann and contributors.
  
  Warning:       Your XML configuration validates against a deprecated schema.
  Suggestion:    Migrate your XML configuration using "--migrate-configuration"!
  
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.004, Memory: 8.00 MB
  
  There was 1 error:
  
  1) App\SourceClassTest::test_hello
  Error: Call to protected method App\SourceClass::hello() from scope App\SourceClassTest
  
  /Users/charles/Workspace/perso/testinfection/tests/SourceClassTest.php:16
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/CombinationApprovals.php:68
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/CombinationApprovals.php:16
  /Users/charles/Workspace/perso/testinfection/tests/SourceClassTest.php:14
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

2) /Users/charles/Workspace/perso/testinfection/src/SourceClass.php:9    [M] Concat

--- Original
+++ New
@@ @@
 {
     public function hello(string $firstname) : string
     {
-        return 'hello ' . $firstname;
+        return $firstname . 'hello ';
     }
 }

$ '/Users/charles/Workspace/perso/testinfection/vendor/phpunit/phpunit/phpunit' '--configuration' '/var/folders/4q/tdlvv18x0wb1sh19lxlyxwzm0000gn/T/infection/phpunitConfiguration.6ef385bd195453effdf64e186977c98a.infection.xml'
  PHPUnit 9.5.9 by Sebastian Bergmann and contributors.
  
  Warning:       Your XML configuration validates against a deprecated schema.
  Suggestion:    Migrate your XML configuration using "--migrate-configuration"!
  
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.006, Memory: 8.00 MB
  
  There was 1 error:
  
  1) App\SourceClassTest::test_hello
  ApprovalTests\ApprovalMismatchException: The approved file does not match the received file
  Approved: /Users/charles/Workspace/perso/testinfection/tests/approvals/SourceClassTest.test_hello.approved.txt
  Received: /Users/charles/Workspace/perso/testinfection/tests/approvals/SourceClassTest.test_hello.received.txt
  
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/Approvals.php:57
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/Approvals.php:20
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/Approvals.php:15
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/CombinationApprovals.php:84
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/CombinationApprovals.php:16
  /Users/charles/Workspace/perso/testinfection/tests/So

3) /Users/charles/Workspace/perso/testinfection/src/SourceClass.php:9    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
 {
     public function hello(string $firstname) : string
     {
-        return 'hello ' . $firstname;
+        return $firstname;
     }
 }

$ '/Users/charles/Workspace/perso/testinfection/vendor/phpunit/phpunit/phpunit' '--configuration' '/var/folders/4q/tdlvv18x0wb1sh19lxlyxwzm0000gn/T/infection/phpunitConfiguration.06f530525136955d0c1592122dbbb77d.infection.xml'
  PHPUnit 9.5.9 by Sebastian Bergmann and contributors.
  
  Warning:       Your XML configuration validates against a deprecated schema.
  Suggestion:    Migrate your XML configuration using "--migrate-configuration"!
  
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.006, Memory: 8.00 MB
  
  There was 1 error:
  
  1) App\SourceClassTest::test_hello
  ApprovalTests\ApprovalMismatchException: The approved file does not match the received file
  Approved: /Users/charles/Workspace/perso/testinfection/tests/approvals/SourceClassTest.test_hello.approved.txt
  Received: /Users/charles/Workspace/perso/testinfection/tests/approvals/SourceClassTest.test_hello.received.txt
  
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/Approvals.php:57
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/Approvals.php:20
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/Approvals.php:15
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/CombinationApprovals.php:84
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/CombinationApprovals.php:16
  /Users/charles/Workspace/perso/testinfection/tests

4) /Users/charles/Workspace/perso/testinfection/src/SourceClass.php:9    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
 {
     public function hello(string $firstname) : string
     {
-        return 'hello ' . $firstname;
+        return 'hello ';
     }
 }

$ '/Users/charles/Workspace/perso/testinfection/vendor/phpunit/phpunit/phpunit' '--configuration' '/var/folders/4q/tdlvv18x0wb1sh19lxlyxwzm0000gn/T/infection/phpunitConfiguration.c6b294432f9f6d97f344301cdfa0b18a.infection.xml'
  PHPUnit 9.5.9 by Sebastian Bergmann and contributors.
  
  Warning:       Your XML configuration validates against a deprecated schema.
  Suggestion:    Migrate your XML configuration using "--migrate-configuration"!
  
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.010, Memory: 8.00 MB
  
  There was 1 error:
  
  1) App\SourceClassTest::test_hello
  ApprovalTests\ApprovalMismatchException: The approved file does not match the received file
  Approved: /Users/charles/Workspace/perso/testinfection/tests/approvals/SourceClassTest.test_hello.approved.txt
  Received: /Users/charles/Workspace/perso/testinfection/tests/approvals/SourceClassTest.test_hello.received.txt
  
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/Approvals.php:57
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/Approvals.php:20
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/Approvals.php:15
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/CombinationApprovals.php:84
  /Users/charles/Workspace/perso/testinfection/vendor/approvals/approval-tests/src/CombinationApprovals.php:16
  /Users/charles/Workspace/perso/testinfection/tests/S
